<template>
  <div>
    <el-dialog title="用户协议" :visible="dialogUserProtocol" center :before-close="agreeBtn">
      <div class="user-protocol">
        <div class="user-protocol-content">
          <div>本协议是您与91LNG（简称"本站"，网址：http://91lng.cn）的所有者成都浩海通达科技有限公司（以下简称为"91LNG"）之间就91LNG服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击"同意并注册"按钮后，本协议即构成对双方有约束力的法律文件。</div>
          <div>第1条 定义及解释</div>
          <div>1.1液化天然气：英文简称“LNG”,指在沸点或沸点以下并在大气压或接近大气压的压力下呈液态的天然气。</div>
          <div>1.2用户：是指接受本协议条款，准备在本站上进行液化天然气（LNG）销售、采购、委托运输等事项的具有相关运营资质的自然人、法人或其他组织。</div>
          <div>1.3保证金：指用户为参与本网站上的交易活动，根据91LNG的规定，用于结算和保证履约的款项。</div>
          <div>1.4服务：本协议阐述之条款和条件适用于您使用“91LNG”中文网站（所涉域名为：http://91lng.cn下同）所提供的在LNG及相关行业企业间(B-TO-B)电子市场(e-market)中进行贸易和交流的各种工具和服务(下称“服务”)。</div>
          <div>第2条 本站服务条款的确认和接纳</div>
          <div>2.1本站的各项在线服务的所有权和运作权归91LNG所有。91LNG可随时自行全权决定更改“条款”。如“条款”有任何变更，91LNG将在其网站上刊载公告，通知予您。如您不同意相关变更，必须停止使用“服务”。当您91LNG网发生争议时，应以最新的服务协议为准。</div>
          <div>2.2用户同意所有注册协议条款并完成注册认证程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</div>
          <div>2.3用户点击同意本协议并认证通过后，即视为用户确认自己具有享受在线购买液化天然气（LNG）及享受其他服务等相应的权利和行为能力，能够独立承担法律责任。“服务”仅供能够根据相关法律订立具有法律约束力的合约的个人或公司使用。因此，您的年龄必须在十八周岁或以上，才可使用本公司服务。如不符合本项条件，请勿使用“服务”。91LNG可随时自行全权决定拒绝向任何人士提供“服务”。“服务”不会提供给被暂时或永久中止资格的91LNG会员。</div>
          <div>2.491LNG保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</div>
          <div>第3条 本站服务及收费</div>
          <div>3.191LNG通过互联网依法为用户提供液化天然气（LNG）产品信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。</div>
          <div>3.2本公司保留在根据第2条通知您后，收取“服务”费用的权利。您因进行交易、向本公司获取有偿服务或接触本公司服务器而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。本公司保留在无须发出书面通知，仅在91LNG网站公示的情况下，暂时或永久地更改或停止部分或全部“服务”的权利。</div>
          <div>第4条 用户信息</div>
          <div>4.1“您的资料”包括您在注册、认证、交易或列举商品过程中、在任何公开信息场合或通过任何电子邮件形式，向本公司或其他用户提供的任何资料，包括数据、文本、软件、音乐、声响、照片、图画、影像、词句或其他材料。您应对“您的资料”负全部责任，而本公司仅作为您在网上发布和刊登“您的资料”的被动渠道。但是，倘若本公司认为“您的资料”可能使本公司承担任何法律或道义上的责任，或可能使本公司(全部或部分地)失去本公司的互联网服务供应商或其他供应商的服务，或您未在91LNG规定的期限内登录或再次登录网站，则本公司可自行全权决定对“您的资料”采取本公司认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给91LNG的“您的资料”拥有全部权利，包括全部版权。您确认，91LNG没有责任去认定或决定您提交给本公司的资料哪些是应当受到保护的，对享有“服务”的其他用户使用“您的资料”，本公司也不必负责。</div>
        </div>
      </div>
      <span slot="footer" class="dialog-footer">
        <el-button type="primary" @click="agreeBtn">同意并继续</el-button>
      </span>
    </el-dialog>
  </div>
</template>
<script>
export default {
  name: 'userProtocol',
  props: {
    dialogUserProtocol: {
      type: Boolean,
      required: true
    },
    agree: Function,
  },

  data: function() {

    return {

    }
  },
  computed: {

  },
  methods: {
    agreeBtn:function(){
      this.$emit('agree');
    }
  }
}

</script>
<style scoped lang="less">
.user-protocol {
  background: #fff;
  border: 1px solid #e4e7ed;
  padding: 20px 40px;
  height: 400px;
  overflow-x: hidden;
}

.user-protocol-content {
  >div {
    text-indent: 2em;
    line-height: 20px;
  }
}

</style>
